performance/load-tests/scenarios/heavy-load.yml
config:
  target: 'http://localhost:8000'
  plugins:
    metrics-by-endpoint:
      useOnlyRequestNames: true
  phases:
    - duration: 120
      arrivalRate: 50
      name: "Ramp up"
    - duration: 600
      arrivalRate: 200
      name: "Heavy load - 200 users/sec"
    - duration: 300
      arrivalRate: 400
      name: "Peak heavy load - 400 users/sec"
    - duration: 180
      arrivalRate: 600
      name: "Maximum heavy load - 600 users/sec"
    - duration: 120
      arrivalRate: 50
      name: "Cool down"
  defaults:
    headers:
      Content-Type: 'application/json'
  pool: 50
  timeout: 30

scenarios:
  - name: "Intensive User Registration"
    weight: 30
    flow:
      - function: "generateUserData"
      - loop:
        - get:
            url: "/health"
        - post:
            url: "/api/v1/auth/send-email-otp"
            json:
              email: "{{ email }}"
        - think: 1
        - post:
            url: "/api/v1/auth/signup"
            json:
              firstName: "{{ firstName }}"
              lastName: "{{ lastName }}"
              email: "{{ email }}"
              password: "{{ password }}"
              phone: "{{ phone }}"
              dateOfBirth: "{{ dateOfBirth }}"
              gender: "{{ gender }}"
              religion: "{{ religion }}"
              caste: "{{ caste }}"
        count: 3

  - name: "Concurrent Login Attempts"
    weight: 25
    flow:
      - function: "generateLoginData"
      - loop:
        - post:
            url: "/api/v1/auth/login"
            json:
              email: "{{ loginEmail }}"
              password: "{{ loginPassword }}"
            capture:
              - json: "$.token"
                as: "authToken"
        - think: 0.5
        count: 5

  - name: "Profile Data Bombardment"
    weight: 20
    flow:
      - function: "generateAuthToken"
      - loop:
        - get:
            url: "/api/v1/user-personal/profile"
            headers:
              Authorization: "Bearer {{ fakeToken }}"
        - post:
            url: "/api/v1/user-personal/update"
            headers:
              Authorization: "Bearer {{ fakeToken }}"
            json:
              firstName: "Updated{{ $randomString() }}"
              lastName: "User{{ $randomString() }}"
        count: 10

  - name: "OTP Spam Testing"
    weight: 15
    flow:
      - function: "generatePhoneData"
      - loop:
        - post:
            url: "/api/v1/auth/send-sms-otp"
            json:
              phone: "{{ testPhone }}"
        - think: 0.2
        - post:
            url: "/api/v1/auth/send-email-otp"
            json:
              email: "spam{{ $randomString() }}@test.com"
        - think: 0.2
        count: 8

  - name: "System Resource Stress"
    weight: 10
    flow:
      - loop:
        - get:
            url: "/health"
        - get:
            url: "/"
        - get:
            url: "/api/v1/auth/nonexistent"
        - think: 0.1
        count: 20

functions:
  generateUserData: "functions/user-data-generator.js"
  generateLoginData: "functions/login-data-generator.js"
  generateAuthToken: "functions/auth-token-generator.js"
  generatePhoneData: "functions/phone-data-generator.js"